aws/amazon-freertos/vendors/nuvoton/sdk/middleware/wifi_esp8266/esp8266_wifi.c
/**************************************************************************//**
 * @file     esp8266_wifi.c
 * @version  V1.10
 * @brief    M480 series ESP8266 WiFi driver source file
 *
 * @copyright (C) 2019 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include "stdlib.h"

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"

/* Socket and Wi-Fi interface includes. */
#include "iot_wifi.h"

/* Wi-Fi driver includes. */
#include "esp8266_wifi.h"

#define ESP8266_ALL_SOCKET_IDS      0xFF

ESP_WIFI_IPD_t xWifiIpd[wificonfigMAX_SOCKETS];

struct ESP_WIFI_PACKET {
    struct ESP_WIFI_PACKET *next;
    uint8_t LinkID;
    uint16_t DataLength;
    uint16_t TotalLength;
} ESP_WIFI_PACKET;

struct ESP_WIFI_PACKET *gPackets, **gPacketsEnd;

/* Uart rx buffer control */
#define RX_BUF_SIZE         4096
#define RX_BUF_RESET()      (rx_buf_ridx = rx_buf_widx = 0)

static uint8_t rx_buf[RX_BUF_SIZE];
static uint16_t rx_buf_ridx, rx_buf_widx;

void RX_BUF_PUSH(uint8_t d)
{
    rx_buf[rx_buf_widx++] = d;
    if (rx_buf_widx == RX_BUF_SIZE) {
        rx_buf_widx = 0;
    }
}

uint8_t RX_BUF_POP(void)
{
    uint8_t d = rx_buf[(rx_buf_ridx++)];

    if (rx_buf_ridx == RX_BUF_SIZE) {
        rx_buf_ridx = 0;
    }

    return d;
}

uint8_t RX_BUF_FULL(void)
{
    if ((rx_buf_widx == (RX_BUF_SIZE - 1)) && (rx_buf_ridx == 0)) {
        return 1;
    }

    if (rx_buf_ridx == (rx_buf_widx + 1)) {
        return 1;
    } else {
        return 0;
    }
}

uint16_t RX_BUF_COUNT(void)
{
    if (rx_buf_widx >= rx_buf_ridx) {
        return (rx_buf_widx - rx_buf_ridx);
    } else {
        return (RX_BUF_SIZE + rx_buf_widx - rx_buf_ridx);
    }
}


/**
 * @brief  Parse an IP address
 */
static void ParseIpAddr( char * string, uint8_t * addr )
{
    char *pcDelim = "\",.";
    char *pcPtr;
    uint8_t ucCount;

    pcPtr = strtok(string, pcDelim);

    for (ucCount = 0; ucCount < 4; ucCount++) {
        addr[ucCount] = atoi(pcPtr);
        pcPtr = strtok(NULL, pcDelim);
    }
}

/**
 * @brief  Parse an MAC address
 */
static void ParseMacAddr( char * string, uint8_t * addr )
{
    char *pcDelim = "\",:";
    char *pcPtr;
    uint8_t ucCount;

    pcPtr = strtok(string, pcDelim);

    for (ucCount = 0; ucCount < 6; ucCount++) {
        addr[ucCount] = strtol(pcPtr, NULL, 16);
        pcPtr = strtok(NULL, pcDelim);
    }
}

/**
 * @brief  Parse an Access Point information
 */
static void ParseApDetail( char * string, WIFIScanResult_t *xBuffer )
{
    char *pcDelim = ",";
    char *pcPtr;
    char *pcSave;
    char *pcSSID;
    uint8_t ucNum = 1;
    uint8_t ucMode;

    pcPtr = strtok_r(string, pcDelim, &pcSave);

    while (pcPtr != NULL) {
        switch (ucNum++) {
        case 1:
            ucMode = (uint8_t)atoi(pcPtr);
            if (ucMode == 4) {
                /* Does not support WPA_WPA2, set it as WPA2 mode */
                ucMode = 3;
            } else if (ucMode > 4) {
                /* Set as eWiFiSecurityNotSupported */
                ucMode = 4;
            }
            xBuffer->xSecurity = (WIFISecurity_t)ucMode;
            break;

        case 2:
            pcSSID = strtok(pcPtr, "\"");
            if (pcSSID) {
								xBuffer->ucSSIDLength = strlen( pcSSID );
								if( xBuffer->ucSSIDLength > wificonfigMAX_SSID_LEN )
								{
								    xBuffer->ucSSIDLength = wificonfigMAX_SSID_LEN;			
								}
								memcpy( xBuffer->ucSSID, pcSSID, xBuffer->ucSSIDLength );
            }
            break;

        case 3:
            xBuffer->cRSSI = (int8_t)atoi(pcPtr);
            break;

        case 4:
            ParseMacAddr(pcPtr, &xBuffer->ucBSSID[0]);
            break;

        case 5:
            xBuffer->ucChannel = (int8_t)atoi(pcPtr);
            break;

        default:
            break;
        }
        pcPtr = strtok_r(NULL, pcDelim, &pcSave);
    }
}

/**
 * @brief  Get device IP and MAC address
 * @param  Obj: pointer to WiF module
 * @retval None
 */
static void AT_ParseAddress( ESP_WIFI_Object_t * pxObj )
{
    char *pcDelim = ",\r\n";
    char *pcPtr;
    char *pcSave;

    pcPtr = strtok_r((char *)pxObj->CmdData, pcDelim, &pcSave);

    while (pcPtr != NULL){
        if (strcmp(pcPtr, "+CIFSR:STAIP") == 0) {
            pcPtr = strtok_r(NULL, pcDelim, &pcSave);
            ParseIpAddr(pcPtr, pxObj->StaIpAddr);
        } else if (strcmp(pcPtr, "+CIFSR:STAMAC") == 0) {
            pcPtr = strtok_r(NULL, pcDelim, &pcSave);
            ParseMacAddr(pcPtr, pxObj->StaMacAddr);
        } else if (strcmp(pcPtr, "+CIFSR:APIP") == 0) {
            pcPtr = strtok_r(NULL, pcDelim, &pcSave);
            ParseIpAddr(pcPtr, pxObj->ApIpAddr);
        } else if (strcmp(pcPtr, "+CIFSR:APMAC") == 0) {
            pcPtr = strtok_r(NULL, pcDelim, &pcSave);
            ParseMacAddr(pcPtr, pxObj->ApMacAddr);
        }
        pcPtr = strtok_r(NULL, pcDelim, &pcSave);
    }
}

/**
 * @brief  Get scanned AP information
 */
static void AT_ParseAccessPoint( ESP_WIFI_Object_t * pxObj, WIFIScanResult_t * pxBuffer, uint8_t ucNumNetworks )
{
    char *pcDelim = "()\r\n";
    char *pcPtr;
    char *pcSave;
    uint8_t ucCount;

    pcPtr = strtok_r((char *)pxObj->CmdData, pcDelim, &pcSave);

    for (ucCount = 0; ucCount < ucNumNetworks; ) {
        if (pcPtr != NULL){
            if (strcmp(pcPtr, "+CWLAP:") == 0) {
                pcPtr = strtok_r(NULL, pcDelim, &pcSave);
                ParseApDetail(pcPtr, (WIFIScanResult_t *)(&pxBuffer[ucCount]));
                ucCount++;
            }
            pcPtr = strtok_r(NULL, pcDelim, &pcSave);
        } else
            break;
    }
}

/**
 * @brief  Initialize platform
 */
BaseType_t ESP_Platform_Init( ESP_WIFI_Object_t * pxObj )
{
    if (pxObj->Uart == (UART_T *)UART1) {
        CLK_EnableModuleClock(UART1_MODULE);
        /* Select UART1 clock source is HXT */
        CLK_SetModuleClock(UART1_MODULE, CLK_CLKSEL1_UART1SEL_HXT, CLK_CLKDIV0_UART1(1));
      
        /* Set PH multi-function pins for UART1 RXD, TXD */
        SYS->GPH_MFPH &= ~(SYS_GPH_MFPH_PH8MFP_Msk | SYS_GPH_MFPH_PH9MFP_Msk);
        SYS->GPH_MFPH |= (SYS_GPH_MFPH_PH8MFP_UART1_TXD | SYS_GPH_MFPH_PH9MFP_UART1_RXD);
        SYS_ResetModule(UART1_RST);
        vTaskDelay(pdMS_TO_TICKS(10));
#if ESP_WIFI_SERIAL_FC
        /* Set PB multi-function pins for UART1 RTS and CTS */
        SYS->GPB_MFPH &= ~(SYS_GPB_MFPH_PB8MFP_Msk | SYS_GPB_MFPH_PB9MFP_Msk);
        SYS->GPB_MFPH |= (SYS_GPB_MFPH_PB8MFP_UART1_nRTS | SYS_GPB_MFPH_PB9MFP_UART1_nCTS);
#endif
    } else {
        configPRINTF(("Do not support MFP setting of UART_BASE 0x%p !\n", pxObj->Uart));
    }

    /* Configure UART */
    UART_Open(pxObj->Uart, pxObj->UartBaudRate);
    /* Set RX Trigger Level = 8 */
    pxObj->Uart->FIFO = (pxObj->Uart->FIFO &~ UART_FIFO_RFITL_Msk) | UART_FIFO_RFITL_8BYTES;
    /* Set Timeout time 0x3E bit-time */
    UART_SetTimeoutCnt(pxObj->Uart, 0x3E);
    /* enable uart */
    UART_EnableInt(pxObj->Uart, UART_INTEN_RDAIEN_Msk | UART_INTEN_RXTOIEN_Msk | UART_INTEN_TOCNTEN_Msk);
    NVIC_EnableIRQ((IRQn_Type)pxObj->UartIrq);

    return pdTRUE;
}

/**
 * @brief  Write data to UART interface
 */
uint16_t ESP_IO_Send( ESP_WIFI_Object_t * pxObj, uint8_t pucTxBuf[], uint16_t usWriteBytes )
{
    if (usWriteBytes < 100)
        Nuvoton_debug_printf(("[%s] \"%s\"\n", __func__, pucTxBuf));
    else
        Nuvoton_debug_printf(("[%s]\n", __func__));

    return UART_Write(pxObj->Uart, pucTxBuf, usWriteBytes);
}

/**
 * @brief  UART interrupt handler for RX
 */
void UART1_IRQHandler(void)
{
    uint8_t ucDat;

    while (!UART_GET_RX_EMPTY(UART1)) {
        if (RX_BUF_FULL()) {
            configPRINTF(("[%s] RX buffer full !!\n", __func__));
        }
        ucDat = UART_READ(UART1);
        RX_BUF_PUSH(ucDat);
    }
}

/**
 * @brief  Read data from UART interface
 */
ESP_WIFI_Status_t ESP_IO_Recv( ESP_WIFI_Object_t * pxObj, uint8_t pucRxBuf[], uint16_t usReadBytes, 
                               uint8_t ucLinkID, TickType_t xTimeout )
{
    ESP_WIFI_Status_t xRet = ESP_WIFI_STATUS_TIMEOUT;
    TickType_t xTickTimeout;
    uint8_t ucRecvHeader[64];
    char *pcDelim = ",:\r\n";
    char *pcPtr;
    char *pcRecv;
    uint8_t ucExit = 0;
    uint8_t ucIpdLinkID = 0;
    uint16_t usCount;
    uint16_t usNum;
    uint16_t usIpdLength;
    uint16_t usAllocLength;

    /* Set timeout ticks */
    xTickTimeout = xTaskGetTickCount() + xTimeout;

