aws/amazon-freertos/vendors/nuvoton/sdk/middleware/wifi_esp8266/esp8266_wifi.c
    /* Clear the receive buffer */
    pcPtr = (char *)(pucRxBuf);
    memset(pcPtr, 0x0, usReadBytes);

    for (usCount = 0; usCount < usReadBytes; usCount++) {
        /* Check RX empty => failed */
        while (RX_BUF_COUNT() == 0) {
            if (xTaskGetTickCount() > xTickTimeout) {
                /* If ESP8266 already receices data, need to wait for data send out complete */
                if ((strstr((char *)pucRxBuf, "\r\nRecv") > 0) && (strstr((char *)pucRxBuf, "bytes\r\n") > 0)) {
                    xTickTimeout += pdMS_TO_TICKS(1000);
                } else {
                    if (xTimeout > pdMS_TO_TICKS(ESP_WIFI_NONBLOCK_RECV_TO)) {
                        configPRINTF(("ERROR: [%s] usReadBytes %d reach the timeout %d !!\n", __func__, usReadBytes, xTimeout));
                    }
                    ucExit = 1;
                    break;
                }
            }
        }
        if (ucExit == 1) {
            break;
        }

        /* Get data from RX buffer */
        pucRxBuf[usCount] = RX_BUF_POP();
        if (xTickTimeout - xTaskGetTickCount() < pdMS_TO_TICKS(5)) {
            xTickTimeout = xTaskGetTickCount() + pdMS_TO_TICKS(10);
        }

        /* Check the end of the message to reduce the response time */
        switch (pucRxBuf[usCount]) {
        case '\n':
            if (strstr(pcPtr, AT_OK_STRING)) {
                ucExit = 1;
                xRet = ESP_WIFI_STATUS_OK;
            } else if ((strstr(pcPtr, AT_FAIL_STRING)) || (strstr(pcPtr, AT_ERROR_STRING))) {
                ucExit = 1;
                xRet = ESP_WIFI_STATUS_ERROR;
            } else if (strstr(pcPtr, AT_CLOSE_STRING)) {
                ucExit = 1;
                xRet = ESP_WIFI_STATUS_CLOSE;
            } else if ((strstr(pcPtr, AT_RECV_STRING)) && (pxObj->IsPassiveMode == pdTRUE)) {
                ucExit = 1;
                xRet = ESP_WIFI_STATUS_RECV;

                pcRecv = strstr(pcPtr, AT_RECV_STRING);
                /* Clear the receive buffer */
                memcpy(ucRecvHeader, pcRecv, sizeof(ucRecvHeader));
                pcRecv = (char *)(ucRecvHeader);

                pcPtr = strstr(pcRecv, AT_RECV_STRING);
                pcPtr = strtok(pcPtr, pcDelim);
                /* Check multiple connection */
                if (pxObj->IsMultiConn == pdTRUE) {
                    /* Get the Link ID */
                    pcPtr = strtok(NULL, pcDelim);
                    ucIpdLinkID = (uint8_t)atoi(pcPtr);
                }
                pcPtr = strtok(NULL, pcDelim);
                usIpdLength = (uint16_t)atoi(pcPtr);
                xWifiIpd[ucIpdLinkID].DataAvailable = usIpdLength;
            }
            break;

        case '>':
            if (strstr(pcPtr, AT_SEND_STRING) == pcPtr) {
                ucExit = 1;
                xRet = ESP_WIFI_STATUS_SEND;
            }
            break;

        case ':':
            if (xWifiIpd[pxObj->ActiveSocket].IsPassiveMode == pdTRUE) {
                /* For TCP passive mode to check +CIPRECVDATA */
                pcRecv = strstr(pcPtr, AT_PASSIVE_STRING);
                if (pcRecv) {
                    /* Clear the receive buffer */
                    memcpy(ucRecvHeader, pcRecv, sizeof(ucRecvHeader));
                    pcRecv = (char *)(ucRecvHeader);

                    /* Get the IPD length */
                    pcPtr = strstr(pcRecv, AT_PASSIVE_STRING);
                    pcPtr = strtok(pcPtr, pcDelim);
                    pcPtr = strtok(NULL, pcDelim);
                    usIpdLength = (uint16_t)atoi(pcPtr);
                    xWifiIpd[pxObj->ActiveSocket].DataReceive = usIpdLength;

                    for (usNum = 0; usNum < usIpdLength; usNum++) {
                        while (RX_BUF_COUNT() == 0) {
                            if (xTaskGetTickCount() > xTickTimeout) {
                                if (xTimeout > pdMS_TO_TICKS(ESP_WIFI_NONBLOCK_RECV_TO)) {
                                    configPRINTF(("ERROR: [%s] Get ipd reach the timeout %d !!\n", __func__, xTimeout));
                                }
                                ucExit = 1;
                                break;
                            }
                        }
                        if (ucExit == 0) {
                            *((char *)(xWifiIpd[pxObj->ActiveSocket].TcpData) + usNum) = RX_BUF_POP();
                            if (xTickTimeout - xTaskGetTickCount() < 5) {
                                xTickTimeout = xTaskGetTickCount() + 10;
                            }
                        } else {
                            break;
                        }
                    }

                    ucExit = 1;
                    xRet = ESP_WIFI_STATUS_RECV;
                }
            } else {
                /* For TCP/UDP active mode to check +IPD */
                pcRecv = strstr(pcPtr, AT_RECV_STRING);
                if (pcRecv) {
                    /* Clear the receive buffer */
                    memcpy(ucRecvHeader, pcRecv, sizeof(ucRecvHeader));
                    pcRecv = (char *)(ucRecvHeader);

                    pcPtr = strstr(pcRecv, AT_RECV_STRING);
                    pcPtr = strtok(pcPtr, pcDelim);
                    /* Check multiple connection */
                    if (pxObj->IsMultiConn == pdTRUE) {
                        /* Get the Link ID */
                        pcPtr = strtok(NULL, pcDelim);
                        ucIpdLinkID = (uint8_t)atoi(pcPtr);
                    }
                    /* Get the IPD length */
                    pcPtr = strtok(NULL, pcDelim);
                    usIpdLength = (uint16_t)atoi(pcPtr);

                    /* for RX packet dynamic malloc */
                    usAllocLength = sizeof(struct ESP_WIFI_PACKET) + usIpdLength;

                    if ((pxObj->HeapUsage + usAllocLength) > ESP_WIFI_IPD_SIZE) {
                        configPRINTF(("ERROR: [%s] ESP_WIFI_IPD_SIZE %d limit exceeded !!\n", __func__, ESP_WIFI_IPD_SIZE));
                        ucExit = 1;
                        break;
                    }

                    //struct ESP_WIFI_PACKET *packet = (struct ESP_WIFI_PACKET *)malloc(usAllocLength);
                    struct ESP_WIFI_PACKET *packet = (struct ESP_WIFI_PACKET *)pvPortMalloc(usAllocLength);
                    if (!packet) {
                        configPRINTF(("ERROR: [%s] Unable to allocate memory for packet !!\n", __func__));
                        ucExit = 1;
                        break;
                    }
                    pxObj->HeapUsage += usAllocLength;

                    packet->LinkID = ucIpdLinkID;
                    packet->DataLength = usIpdLength;
                    packet->TotalLength = usIpdLength;
                    packet->next = 0;

                    for (usNum = 0; usNum < usIpdLength; usNum++) {
                        while (RX_BUF_COUNT() == 0) {
                            if (xTaskGetTickCount() > xTickTimeout) {
                                if (xTimeout > pdMS_TO_TICKS(ESP_WIFI_NONBLOCK_RECV_TO)) {
                                    configPRINTF(("ERROR: [%s] Get ipd reach the timeout %d !!\n", __func__, xTimeout));
                                }
                                ucExit = 1;
                                break;
                            }
                        }
                        if (ucExit == 0) {
                            *((char *)(packet + 1) + usNum) = RX_BUF_POP();
                            if (xTickTimeout - xTaskGetTickCount() < 5) {
                                xTickTimeout = xTaskGetTickCount() + 10;
                            }
                        } else {
                            break;
                        }
                    }

                    // Append to packet list
                    *gPacketsEnd = packet;
                    gPacketsEnd = &packet->next;

