aws/amazon-freertos/vendors/nuvoton/sdk/middleware/wifi_esp8266/esp8266_wifi.c
                    ucExit = 1;
                    xRet = ESP_WIFI_STATUS_RECV;
                }
            }
            break;

        default:
            break;
        }
        if (ucExit == 1) {
            break;
        }
    }
    if (usCount < 100) {
        if (usCount > 0)
            Nuvoton_debug_printf(("[%s] \"%s\", usCount = %d, xRet = %d\n", __func__, pucRxBuf, usCount, xRet));
        else
            Nuvoton_debug_printf(("."));
    } else
        Nuvoton_debug_printf(("[%s], usCount = %d, xRet = %d\n", __func__, usCount, xRet));

    return xRet;
}

/**
 * @brief  Execute AT command
 * @param  pxObj: pointer to WiF module
 * @param  pucCmd: pointer to AT command string
 * @param  ulTimeWaitMs: command wait time in ms
 * @retval Operation status
 */
static ESP_WIFI_Status_t ESP_AT_Command( ESP_WIFI_Object_t * pxObj, uint8_t * pucCmd, uint32_t ulTimeWaitMs )
{
    ESP_WIFI_Status_t xRet = ESP_WIFI_STATUS_TIMEOUT;
    uint16_t usCount;

    /* Wait for last AT command is done */
    while (xTaskGetTickCount() < pxObj->AvailableTick) {
        taskYIELD();
    }

    if (ESP_IO_Send(pxObj, pucCmd, strlen((char *)pucCmd)) > 0) {
        do {
            xRet = ESP_IO_Recv(pxObj, pxObj->CmdData, sizeof(pxObj->CmdData), 0, pxObj->Timeout);

            if (ulTimeWaitMs > 0) {
                /* Set the time that next AT command is workable */
                pxObj->AvailableTick = xTaskGetTickCount() + pdMS_TO_TICKS(ulTimeWaitMs);
            }
        } while (xRet > ESP_WIFI_STATUS_TIMEOUT);
    }
    Nuvoton_debug_printf(("[%s] pucCmd %s, xRet = %d\n", __func__, pucCmd, xRet));

    return xRet;
}

/**
 * @brief  Check the DNS server setting
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_CheckDnsServer( ESP_WIFI_Object_t * pxObj )
{
    ESP_WIFI_Status_t xRet;
    char *pcDelim = ":\r\n";
    char *pcPtr;

    sprintf((char *)pxObj->CmdData, "AT+CIPDNS_DEF?\r\n");
    xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 0);

    if (xRet == ESP_WIFI_STATUS_OK) {
        xRet = ESP_WIFI_STATUS_ERROR;

        pcPtr = strtok((char *)pxObj->CmdData, pcDelim);
        while (pcPtr != NULL){
            if (strcmp(pcPtr, "+CIPDNS_DEF") == 0) {
                pcPtr = strtok(NULL, pcDelim);

                /* To check is there a DNS server */
                if (strcmp(pcPtr, "255.255.255.255") == 0) {
                    configPRINTF(("There is no DNS server, set it to be resolver1.opendns.com.\n"));
                    /* Specify the DNS server to resolver1.opendns.com */
                    sprintf((char *)pxObj->CmdData, "AT+CIPDNS_DEF=1,\"208.67.222.222\"\r\n");
                    xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 0);
                }
                break;
            }
            pcPtr = strtok(NULL, pcDelim);
        }
    }

    return xRet;
}

/**
 * @brief  Initialize WIFI module
 * @param  Obj: pointer to WiF module
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_Init( ESP_WIFI_Object_t * pxObj )
{
    ESP_WIFI_Status_t xRet = ESP_WIFI_STATUS_ERROR;

    if (ESP_Platform_Init(pxObj) == pdTRUE) {
        /* Reset the WiFi module */
        xRet = ESP_WIFI_Reset(pxObj);

        ESP_WIFI_CheckDnsServer(pxObj);
    }

    return xRet;
}

/**
 * @brief  Connects to an AP
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_Connect( ESP_WIFI_Object_t * pxObj, const char * cSSID, const char * cPassword )
{
    ESP_WIFI_Status_t xRet;

    /* Reset the WiFi module */
    xRet = ESP_WIFI_Reset(pxObj);

    /* Set WiFi to STA mode */
    xRet = ESP_AT_Command(pxObj, (uint8_t *)"AT+CWMODE=1\r\n", 0);

    if (xRet == ESP_WIFI_STATUS_OK) {
        configPRINTF(("Try to connect to AP \"%s\" ...\n", cSSID));
        sprintf((char *)pxObj->CmdData, "AT+CWJAP=\"%s\",\"%s\"\r\n", cSSID, cPassword);
        xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 0);
        if (xRet == ESP_WIFI_STATUS_OK) {
            pxObj->IsConnected = pdTRUE;

            /* Enable multiple connections */
            xRet = ESP_WIFI_SetMultiConn(pxObj, (uint8_t)1);

            if (xRet == ESP_WIFI_STATUS_OK) {
                /* Enable TCP passive mode */
                xRet = ESP_WIFI_SetTcpPassive(pxObj, (uint8_t)ESP_WIFI_TCP_PASSIVE);
#if ESP_WIFI_SERIAL_FC
                if (xRet == ESP_WIFI_STATUS_OK) {
                    /* Enable TCP passive mode */
                    xRet = ESP_WIFI_StartSerialFlowCtrl(pxObj);
                }
#endif
            }
        }
    }

    return xRet;
}

/**
 * @brief  Disconnects from the AP
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_Disconnect( ESP_WIFI_Object_t * pxObj )
{
    ESP_WIFI_Status_t xRet;

    xRet = ESP_AT_Command(pxObj, (uint8_t *)"AT+CWQAP\r\n", 0);
    if (xRet == ESP_WIFI_STATUS_OK) {
        pxObj->IsConnected = pdFALSE;
        /* Prevent scan AP soon and returns an error */
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    return xRet;
}

/**
 * @brief  Restarts the module
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_Reset( ESP_WIFI_Object_t * pxObj )
{
    ESP_WIFI_Status_t xRet;
    uint8_t ucCount;

#if ESP_WIFI_HW_RESET
    /* H/W reset */
    GPIO_SetMode(PH, BIT3, GPIO_MODE_OUTPUT);
    PH3 = 0;
    vTaskDelay(pdMS_TO_TICKS(2));
    PH3 = 1;
    xRet = ESP_WIFI_STATUS_OK;
    vTaskDelay(pdMS_TO_TICKS(200));
#else
    /* S/W reset */
    xRet = ESP_AT_Command(pxObj, (uint8_t *)"AT+RST\r\n", 1000);
    vTaskDelay(pdMS_TO_TICKS(500));
#endif
  
    /* Reset the flags and RX buffer */
    pxObj->IsMultiConn = pdFALSE;
    pxObj->IsPassiveMode = pdFALSE;
    pxObj->HeapUsage = 0;
    pxObj->ActiveSocket = 0;
    gPackets = 0;
    gPacketsEnd = &gPackets;
    RX_BUF_RESET();

    /* Clear the socket Ipd buffer */
    ESP_WIFI_Clear_Ipd(pxObj, ESP8266_ALL_SOCKET_IDS);

    // Might take a while to respond after HW reset
    for (int i = 0; i < 5; i++) {
        xRet = ESP_AT_Command(pxObj, (uint8_t *)"AT\r\n", 100);
        if (xRet == ESP_WIFI_STATUS_OK) {
            break;
        }
    }
    
    return xRet;
}

/**
 * @brief  Lists Available APs
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_Scan( ESP_WIFI_Object_t * pxObj, WIFIScanResult_t * pxBuffer, uint8_t ucNumNetworks )
{
    ESP_WIFI_Status_t xRet;

