aws/amazon-freertos/vendors/nuvoton/sdk/middleware/wifi_esp8266/esp8266_wifi.c
    xRet = ESP_AT_Command(pxObj, "AT+CWLAP\r\n", 0);

    if (xRet == ESP_WIFI_STATUS_OK) {
        AT_ParseAccessPoint(pxObj, pxBuffer, ucNumNetworks);
    }

    return xRet;
}

/**
 * @brief  Check the module is connected to an AP
 */
BaseType_t ESP_WIFI_IsConnected( ESP_WIFI_Object_t * pxObj )
{
    return pxObj->IsConnected;
}

/**
 * @brief  Get network status
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_GetNetStatus( ESP_WIFI_Object_t * pxObj )
{
    ESP_WIFI_Status_t xRet;

    xRet = ESP_AT_Command(pxObj, (uint8_t *)"AT+CIFSR\r\n", 0);

    if (xRet == ESP_WIFI_STATUS_OK) {
        AT_ParseAddress(pxObj);
    }

    return xRet;
}

/**
 * @brief  Clear the Ipd buffer
 */
void ESP_WIFI_Clear_Ipd( ESP_WIFI_Object_t * pxObj, uint8_t LinkID )
{
    struct ESP_WIFI_PACKET **p = &gPackets;

    while (*p) {
        if ((*p)->LinkID == LinkID || LinkID == ESP8266_ALL_SOCKET_IDS) {
            struct ESP_WIFI_PACKET *q = *p;

            if (gPacketsEnd == &(*p)->next) {
                gPacketsEnd = p; // Set last packet next field/gPacketsEnd
            }
            *p = (*p)->next;
            pxObj->HeapUsage -= (sizeof(struct ESP_WIFI_PACKET) + q->TotalLength);;
            free(q);
        } else {
            // Point to last packet next field
            p = &(*p)->next;
        }
    }
    if (LinkID == ESP8266_ALL_SOCKET_IDS) {
        for (int id = 0; id < 5; id++) {
            xWifiIpd[LinkID].DataAvailable = 0;
        }
    } else {
        xWifiIpd[LinkID].DataAvailable = 0;
    }
}

/**
 * @brief  Get the Ipd buffer size of this socket
 */
uint16_t ESP_WIFI_Get_Ipd_Size( ESP_WIFI_Object_t * pxObj )
{
    return pxObj->HeapUsage;
}

/**
 * @brief  Get the connection status
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_GetConnStatus( ESP_WIFI_Object_t * pxObj, ESP_WIFI_Conn_t * pxConn )
{
    ESP_WIFI_Status_t xRet;
    char *pcDelim = ":,\r\n";
    char *pcPtr;
    uint8_t ucCount;

    xRet = ESP_AT_Command(pxObj, (uint8_t *)"AT+CIPSTATUS\r\n", 0);

    if (xRet == ESP_WIFI_STATUS_OK) {
        pxConn->IsConnected = pdFAIL;
        pcPtr = strtok((char *)pxObj->CmdData, pcDelim);
        /* Skip the first line of response */
        pcPtr = strtok(NULL, pcDelim);

        while (pcPtr != NULL){
            if (strcmp(pcPtr, "+CIPSTATUS") == 0) {
                pcPtr = strtok(NULL, pcDelim);
                if (pxConn->LinkID == (uint8_t)atoi(pcPtr)) {
                    pxConn->IsConnected = pdTRUE;
                    break;
                }
            } else if (strcmp(pcPtr, "STATUS") == 0) {
                pcPtr = strtok(NULL, pcDelim);
                pxConn->Status = (uint8_t)atoi(pcPtr);
            }
            pcPtr = strtok(NULL, pcDelim);
        }
    }

    return xRet;
}

/**
 * @brief  Ping an IP address
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_Ping( ESP_WIFI_Object_t * pxObj, uint8_t * pucIPAddr )
{
    sprintf((char *)pxObj->CmdData, "AT+PING=\"%d.%d.%d.%d\"\r\n", pucIPAddr[0], pucIPAddr[1], pucIPAddr[2], pucIPAddr[3]);

    return ESP_AT_Command(pxObj, pxObj->CmdData, 0);
}

/**
 * @brief  Get the IP address from a host name
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_GetHostIP( ESP_WIFI_Object_t * pxObj, char * pcHost, uint8_t * pucIPAddr )
{
    ESP_WIFI_Status_t xRet;
    char *pcDelim = ":\r\n";
    char *pcPtr;

    sprintf((char *)pxObj->CmdData, "AT+CIPDOMAIN=\"%s\"\r\n", pcHost);
    xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 0);

    if (xRet == ESP_WIFI_STATUS_OK) {
        xRet = ESP_WIFI_STATUS_ERROR;

        pcPtr = strtok((char *)pxObj->CmdData, pcDelim);
        while (pcPtr != NULL){
            if (strcmp(pcPtr, "+CIPDOMAIN") == 0) {
                pcPtr = strtok(NULL, pcDelim);
                ParseIpAddr(pcPtr, pucIPAddr);
                xRet = ESP_WIFI_STATUS_OK;
                break;
            }
            pcPtr = strtok(NULL, pcDelim);
        }
    }

    return xRet;
}

/**
 * @brief  Enable or Disable Multiple Connections
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_SetMultiConn( ESP_WIFI_Object_t * pxObj, uint8_t mode )
{
    ESP_WIFI_Status_t xRet;

    sprintf((char *)pxObj->CmdData, "AT+CIPMUX=%d\r\n", mode);
    xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 0);

    if (xRet == ESP_WIFI_STATUS_OK) {
        pxObj->IsMultiConn = (mode) ? pdTRUE : pdFALSE;
    }

    return xRet;
}

/**
 * @brief  Enable or Disable TCP Passive Mode
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_SetTcpPassive( ESP_WIFI_Object_t * pxObj, uint8_t mode )
{
    ESP_WIFI_Status_t xRet;

    sprintf((char *)pxObj->CmdData, "AT+CIPRECVMODE=%d\r\n", mode);
    xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 0);

    if (xRet == ESP_WIFI_STATUS_OK) {
        pxObj->IsPassiveMode = (mode) ? pdTRUE : pdFALSE;
    }

    return xRet;
}

#if ESP_WIFI_SERIAL_FC
/**
 * @brief  Enable H/W UART Flow Control
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_StartSerialFlowCtrl( ESP_WIFI_Object_t * pxObj)
{
    ESP_WIFI_Status_t xRet;

    configPRINTF(("Enable WiFi H/W flow control\n"));
    sprintf((char *)pxObj->CmdData, "AT+UART_CUR=%d,8,1,0,3\r\n", wificonfigBAUD_RATE);
    xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 0);

    if (xRet == ESP_WIFI_STATUS_OK) {
        if (wificonfigBAUD_RATE != 115200) {
            /* Setup the baud rate */
            configPRINTF(("Change baudrate to %d\n", wificonfigBAUD_RATE));
            UART_Open(pxObj->Uart, wificonfigBAUD_RATE);
        }
        // NOTE: Added in M480. Before configuring RTSACTLV, disable TX/RX.
        pxObj->Uart->FUNCSEL |= UART_FUNCSEL_TXRXDIS_Msk;
        while (pxObj->Uart->FIFOSTS & UART_FIFOSTS_TXRXACT_Msk);
        // nRTS pin output is low level active
        pxObj->Uart->MODEM |= UART_MODEM_RTSACTLV_Msk;
        // nCTS pin input is low level active
        pxObj->Uart->MODEMSTS |= UART_MODEMSTS_CTSACTLV_Msk;
        // NOTE: Added in M480. After configuring RTSACTLV, re-enable TX/RX.
        pxObj->Uart->FUNCSEL &= ~UART_FUNCSEL_TXRXDIS_Msk;
        // Configure RTS trigger level to 8 bytes
        pxObj->Uart->FIFO = (pxObj->Uart->FIFO & ~UART_FIFO_RTSTRGLV_Msk) | UART_FIFO_RTSTRGLV_8BYTES;
        // Enable RTS
        pxObj->Uart->INTEN |= UART_INTEN_ATORTSEN_Msk;
        // Enable CTS
        pxObj->Uart->INTEN |= UART_INTEN_ATOCTSEN_Msk;
    }

    return xRet;
}
#endif

/**
 * @brief  Establishes TCP Connection, UDP Transmission or SSL Connection
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_StartClient( ESP_WIFI_Object_t * pxObj, ESP_WIFI_Conn_t * pxConn )
{
    ESP_WIFI_Status_t xRet;
    ESP_WIFI_Status_t xClose;
    uint8_t ucCount;

    /* Set multiple connection */
    if (pxObj->IsMultiConn == pdTRUE) {
        sprintf((char *)pxObj->CmdData, "AT+CIPSTART=%d,", pxConn->LinkID);
    } else {
        sprintf((char *)pxObj->CmdData, "AT+CIPSTART=");
    }

    xWifiIpd[pxConn->LinkID].IsPassiveMode = pdFALSE;
    /* Set connection type */
    switch (pxConn->Type) {
    case ESP_WIFI_TCP:
        sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), "\"TCP\",");
        xWifiIpd[pxConn->LinkID].IsPassiveMode = pxObj->IsPassiveMode;
        break;
    case ESP_WIFI_UDP:
        sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), "\"UDP\",");
        break;
    case ESP_WIFI_SSL:
        sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), "\"SSL\",");
        break;
    }

    /* Set remote IP address and port */
    sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), "\"%d", pxConn->RemoteIP[0]);
    for (ucCount = 1; ucCount < 4; ucCount++) {
        sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), ".%d", pxConn->RemoteIP[ucCount]);
    }
    sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), "\",%d", pxConn->RemotePort);

    /* Set remaining data */
    if (pxConn->Type == ESP_WIFI_UDP) {
        if (pxConn->UdpLocalPort > 0) {
            sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), ",%d,%d", pxConn->UdpLocalPort, pxConn->UdpMode);
        }
    } else {
        if (pxConn->TcpKeepAlive > 0) {
            sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), ",%d", pxConn->TcpKeepAlive);
        }
    }

    sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), "\r\n");
    xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 0);

    if (xRet != ESP_WIFI_STATUS_OK) {
        configPRINTF(("%s returns %d failed !!\n", __func__, xRet));
        /* Wait for socket closed if returns error */
        if ((xRet == ESP_WIFI_STATUS_ERROR) && (!strstr((char *)pxObj->CmdData, "ALREADY CONNECTED"))) {
            do {
                Nuvoton_debug_printf(("Socket connect error, Wait for socket close.\n"));
                xClose = ESP_IO_Recv(pxObj, pxObj->CmdData, sizeof(pxObj->CmdData), 0, pxObj->Timeout);
            } while (xClose != ESP_WIFI_STATUS_CLOSE);
            pxObj->AvailableTick = xTaskGetTickCount() + pdMS_TO_TICKS(200);
        }
    }

    return xRet;
}

/**
 * @brief  Closes the TCP/UDP/SSL Connection
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_StopClient( ESP_WIFI_Object_t * pxObj, ESP_WIFI_Conn_t * pxConn )
{
    if (pxObj->IsMultiConn == pdTRUE) {
        sprintf((char *)pxObj->CmdData, "AT+CIPCLOSE=%d\r\n", pxConn->LinkID);
    } else {
        sprintf((char *)pxObj->CmdData, "AT+CIPCLOSE\r\n");
    }

    return ESP_AT_Command(pxObj, pxObj->CmdData, 0);
}

/**
 * @brief  Sends Data
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_Send( ESP_WIFI_Object_t * pxObj, ESP_WIFI_Conn_t * pxConn, uint8_t * pcBuf, 
                                 uint16_t usReqLen, uint16_t * usSendLen, TickType_t xTimeout )
{
    ESP_WIFI_Status_t xRet = ESP_WIFI_STATUS_ERROR;
    TickType_t xTickCurrent, xTickEnd, xTickTimeout;
    uint16_t usAskSend, usRealSend;
    uint8_t ucExit = 0;
    uint8_t ucCount;

    xTickEnd = xTaskGetTickCount() + xTimeout;

    if (pcBuf == NULL) {
        return xRet;
    }

    (*usSendLen) = 0;
    while ((*usSendLen) < usReqLen) {
        usAskSend = usReqLen - (*usSendLen);
        if (usAskSend > ESP_WIFI_SEND_SIZE)
            usAskSend = ESP_WIFI_SEND_SIZE;

        /* Set multiple connection */
        if (pxObj->IsMultiConn == pdTRUE) {
            sprintf((char *)pxObj->CmdData, "AT+CIPSEND=%d,%d", pxConn->LinkID, usAskSend);
        } else {
            sprintf((char *)pxObj->CmdData, "AT+CIPSEND=%d", usAskSend);
        }

        /* Set remote IP and port for UDP connection */
        if ((pxConn->Type == ESP_WIFI_UDP) && (pxConn->UdpLocalPort > 0)) {
            sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), "\"%d", pxConn->RemoteIP[0]);
            for (ucCount = 1; ucCount < 4; ucCount++) {
                sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), ".%d", pxConn->RemoteIP[ucCount]);
            }
            sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), "\",%d", pxConn->RemotePort);
        }

        sprintf((char *)pxObj->CmdData + strlen((char *)pxObj->CmdData), "\r\n");
        /* Must wait a period of time after the CIPSEND AT command */
        xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 10);

        if (xRet == ESP_WIFI_STATUS_OK) {
            xRet = ESP_WIFI_STATUS_ERROR;

            xTickCurrent = xTaskGetTickCount();
            if (xTickCurrent < xTickEnd) {
                xTickTimeout = xTickEnd - xTickCurrent;
                if (ESP_IO_Recv(pxObj, pxObj->CmdData, sizeof(pxObj->CmdData), 0, xTickTimeout) == ESP_WIFI_STATUS_SEND) {
                    /* WiFi module allows to send data */
                    memcpy(pxObj->CmdData, pcBuf + (*usSendLen), usAskSend);
                    *(pxObj->CmdData + usAskSend) = 0;
                    usRealSend = ESP_IO_Send(pxObj, pxObj->CmdData, usAskSend);
                    if (usRealSend > 0) {
                        do {
                            xTickCurrent = xTaskGetTickCount();
                            if (xTickCurrent >= xTickEnd) {
                                xRet = ESP_WIFI_STATUS_TIMEOUT;
                            } else {
                                xTickTimeout = xTickEnd - xTickCurrent;
                                /* Ensure the module has enough time to send data */
                                if (xTickTimeout < pdMS_TO_TICKS(200)) {
                                    xTickTimeout = pdMS_TO_TICKS(200);
                                }
                                xRet = ESP_IO_Recv(pxObj, pxObj->CmdData, sizeof(pxObj->CmdData), 0, xTickTimeout);
                            }
                        } while (xRet > ESP_WIFI_STATUS_TIMEOUT);
                        (*usSendLen) += usRealSend;
                    }
                }
            } else {
                xRet = ESP_WIFI_STATUS_TIMEOUT;
                break;
            }
        } else {
            break;
        }
    }

    return xRet;
}

/**
 * @brief  Receive Data for TCP passive mode
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_Recv_TCP_PASSIVE( ESP_WIFI_Object_t * pxObj, uint8_t ucLinkID, uint8_t * pcBuf, 
                                 uint16_t usReqLen, uint16_t * usRecvLen, TickType_t xTickEnd )
{
    ESP_WIFI_Status_t xRet = ESP_WIFI_STATUS_TIMEOUT;
    TickType_t xTickCurrent, xTickTimeout;
    uint8_t ucDoFlag = 1;

    if (xWifiIpd[ucLinkID].DataAvailable != 0) {
        xWifiIpd[ucLinkID].TcpData = (char *)pcBuf;
        xWifiIpd[ucLinkID].DataReceive = 0;
        pxObj->ActiveSocket = ucLinkID;

        // +CIPRECVDATA supports up to 2048 bytes at a time
        usReqLen = usReqLen > 2048 ? 2048 : usReqLen;

        sprintf((char *)pxObj->CmdData, "AT+CIPRECVDATA=%d,%d\r\n", ucLinkID, usReqLen);
        xRet = ESP_AT_Command(pxObj, pxObj->CmdData, 0);

        if (xRet == ESP_WIFI_STATUS_OK) {
            if (xWifiIpd[ucLinkID].DataReceive > 0) {
                if (xWifiIpd[ucLinkID].DataAvailable > xWifiIpd[ucLinkID].DataReceive) {
                    xWifiIpd[ucLinkID].DataAvailable -= xWifiIpd[ucLinkID].DataReceive;
                } else {
                    xWifiIpd[ucLinkID].DataAvailable = 0;
                }
                (*usRecvLen) = xWifiIpd[ucLinkID].DataReceive;
            }
        }
    } else {
        // Try to get the +IPD message
        xRet = ESP_IO_Recv(pxObj, pxObj->CmdData, sizeof(pxObj->CmdData), ucLinkID, ESP_WIFI_SHORT_RECV_TO);
        // To avoid upper layer receive unknown status
        if (xRet == ESP_WIFI_STATUS_RECV)
            xRet = ESP_WIFI_STATUS_TIMEOUT;
    }

    return xRet;
}

/**
 * @brief  Receive Data
 * @retval Operation status
 */
ESP_WIFI_Status_t ESP_WIFI_Recv( ESP_WIFI_Object_t * pxObj, ESP_WIFI_Conn_t * pxConn, uint8_t * pcBuf, 
                                 uint16_t usReqLen, uint16_t * usRecvLen, TickType_t xTimeout )
{
    ESP_WIFI_Status_t xRet = ESP_WIFI_STATUS_ERROR;
    TickType_t xTickCurrent, xTickEnd, xTickTimeout;
    uint8_t ucDoFlag = 1;

    if (pcBuf == NULL) {
        return xRet;
    }

    xTickEnd = xTaskGetTickCount() + xTimeout;
    (*usRecvLen) = 0;

    /* Check TCP passive mode */
    if (xWifiIpd[pxConn->LinkID].IsPassiveMode == pdTRUE) {
        /* TCP passive mode */
        if (usReqLen > 0)
            xRet = ESP_WIFI_Recv_TCP_PASSIVE(pxObj, pxConn->LinkID, pcBuf, usReqLen, usRecvLen, xTickEnd);
        else
            xRet = ESP_WIFI_STATUS_OK;
    } else {
        /* TCP/UDP active mode */
        while (((*usRecvLen) < usReqLen) && (ucDoFlag == 1)) {
            // Check if any packets are ready for us
            for (struct ESP_WIFI_PACKET **p = &gPackets; *p; p = &(*p)->next) {
                if ((*p)->LinkID == pxConn->LinkID) {
                    struct ESP_WIFI_PACKET *q = *p;

                    if (q->DataLength <= usReqLen) {
                        // Return and remove full packet
                        memcpy(pcBuf, q + 1, q->DataLength);

                        if (gPacketsEnd == &(*p)->next) {
                            gPacketsEnd = p;
                        }
                        *p = (*p)->next;

                        //free(q);
                        vPortFree(q);
                        pxObj->HeapUsage -= (sizeof(struct ESP_WIFI_PACKET) + q->TotalLength);
                        (*usRecvLen) = q->DataLength;
                    } else {
                        // Return only partial packet
                        memcpy(pcBuf, q + 1, usReqLen);

                        q->DataLength -= usReqLen;
                        memmove(q + 1, (uint8_t *)(q + 1) + usReqLen, q->DataLength);

                        (*usRecvLen) = usReqLen;
                    }
                    xRet = ESP_WIFI_STATUS_OK;
                    break;
                }
            }

            if ((*usRecvLen) == 0) {
                do {
                    xTickCurrent = xTaskGetTickCount();
                    if (xTickCurrent < xTickEnd) {
                        xTickTimeout = xTickEnd - xTickCurrent;
                    } else {
                        ucDoFlag = 0;
                        xRet = ESP_WIFI_STATUS_TIMEOUT;
                        break;
                    }

                    xRet = ESP_IO_Recv(pxObj, pxObj->CmdData, sizeof(pxObj->CmdData), pxConn->LinkID, xTickTimeout);
                } while (xRet != ESP_WIFI_STATUS_RECV);
            } else {
                ucDoFlag = 0;
            }
        }
    }

    return xRet;
}
